//
//  Pay.h
//  PayStructure
//
//  Created by jansti on 2017/9/9.
//  Copyright © 2017年 jansti. All rights reserved.
//

#ifndef Pay_h
#define Pay_h


/*
 
 薪水支付案例研究.
 
 客户交流:
 1 有些员工钟点工.每天提交工作时间卡,记录日期和工作时长.如果超过8小时,超过的部分按正常的1.5支付. 每周五支付.
 2 月薪支付.每个月的最后一个工作日支付.他们的雇员记录中有一个月薪字段.
 3 带薪雇员.根据销售支付酬薪,提供销售凭条,记录销售的日期和数量.雇员记录中有一个酬薪报酬字段.每个一周的周五支付.
 4 雇员可以选择支付方式. 支票邮寄到邮政地址 或者 保存在出纳那随时支取 或者 直接打入银行账户.
 5 雇员会加入协会.这些的雇员记录里有一个每周应付款项字段.这些要从薪水中扣除.协会有时会征收费用,协会每周会提交这些费用,这些费用,要在相应雇员的下个月薪水总额中扣除.
 6 支付程序每天工作一次,为相应的雇员支付.系统告诉雇员的支付日期,计算从上次支付日期到本次应付的钱数.
 
 
 
 
 
 
 */


#endif /* Pay_h */
